docs/export/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>cosmo.el</title>
<!-- 2017-04-22 Sat 17:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Francesco Montanari" />
</head>
<body>
<div id="content">
<h1 class="title">cosmo.el</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Description</a></li>
<li><a href="#sec-2">2. Download</a></li>
<li><a href="#sec-3">3. Installation</a></li>
<li><a href="#sec-4">4. Usage</a></li>
<li><a href="#sec-5">5. Support</a></li>
<li><a href="#sec-6">6. Contributing</a></li>
</ul>
</div>
</div>
<p>
cosmo.el &#x2014; Cosmological Calculator
</p>

<p>
Copyright (C) 2017 Francesco Montanari
</p>

<p>
This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.
</p>

<p>
This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.
</p>

<p>
You should have received a copy of the GNU General Public License
along with this program.  If not, see <a href="http://www.gnu.org/licenses/">http://www.gnu.org/licenses/</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
This package provides a cosmological calculator integrated into the
Emacs text editor.
</p>

<p>
Cosmological quantities are computed for a Lambda-CDM model. Such a
framework describes a homogeneous and isotropic universe containing
a cosmological constant (Lambda) and a Cold Dark Matter (CDM)
component, besides ordinary species. The model is characterized by
the following parameters:
</p>
<dl class="org-dl">
<dt> H<sub>0</sub> </dt><dd>Hubble parameter (expansion rate) today
</dd>
<dt> Omega<sub>m0</sub> </dt><dd>Fractional matter density parameter today.
</dd>
<dt> Omega<sub>Lambda</sub> </dt><dd>Cosmological constant density parameter. At the
moment we consider only flat Lambda-CDM models,
for which <code>Omega_Lambda = 1 - Omega_m0</code>.
</dd>
</dl>

<p>
All cosmological quantities are computed at a given redshift value:
</p>
<dl class="org-dl">
<dt> redshift </dt><dd>Gravitational redshift of photons frequency due to the
expansion of the Universe.
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Download</h2>
<div class="outline-text-2" id="text-2">
<p>
The source code can be downloaded from the <a href="https://gitlab.com/montanari/cosmo-el">git repository page</a>.
</p>

<p>
Alternatively, the git repository can be cloned:
</p>
<div class="org-src-container">

<pre class="src src-shell">git clone git@gitlab.com:montanari/cosmo-el.git
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Installation</h2>
<div class="outline-text-2" id="text-3">
<p>
Copy the <code>cosmo-el</code> file into your Emacs configuration
directory. E.g., on GNU systems:
</p>

<div class="org-src-container">

<pre class="src src-shell">mkdir ~/.emacs.d/cosmo-el
cp cosmo.el ~/.emacs.d/cosmo-el
</pre>
</div>

<p>
Open your Emacs configuration file (e.g., <code>~\/.emacs</code> on GNU
systems), and add the following lines:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;; Cosmological calculator
(add-to-list 'load-path "~/.emacs.d/cosmo-el/")
(require 'cosmo)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Usage</h2>
<div class="outline-text-2" id="text-4">
<p>
Open Emacs and type <code>M-x cosmo-command</code>, where the <code>command</code> name
varies depending on the desired computation. For example:
</p>

<dl class="org-dl">
<dt> cosmo-set-params </dt><dd>Set cosmological parameters.
</dd>

<dt> cosmo-calculator </dt><dd>Compute cosmology and display summary table in
a new buffer. The following illustrates a possible output:
<pre class="example">
Cosmology calculator.

Input Parameters
----------------
- Redshift:                       	0.1
- Hubble constant, now [km/s/Mpc]:	70
- Matter fractional density, now: 	0.3
&lt;...&gt;

Cosmography at required redshift
-------------------------------
- Hubble parameter [km/s/Mpc]:	73.39325582095401
&lt;...&gt;
</pre>
</dd>
</dl>

<p>
A complete list of interactive commands can be obtained by typing
<code>M-x cosmo- TAB</code>. Documentation is available through <code>C-h f
  cosmo-command</code>, where <code>command</code> should be adapted to the particular
command.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Support</h2>
<div class="outline-text-2" id="text-5">
<p>
Bugs and issues are tracked through the <a href="https://gitlab.com/montanari/cosmo-el">git repository page</a>. Please
see <a href="http://www.chiark.greenend.org.uk/~sgtatham/bugs.html">this page</a> about how to report bugs effectively.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Contributing</h2>
<div class="outline-text-2" id="text-6">
<p>
<i>The project is still at an early stage</i>. Recommendations (and
contributions) aimed to improve the source code are highly
appreciated. New feature suggestions are also welcome, but at this
point priority will be given to reach an idiomatic and extensible
code.
</p>

<p>
Contributions can be submitted as patches. See <a href="http://orgmode.org/worg/org-contribute.html#patches">this page</a> for an
example of good patches contributions.
</p>

<p>
More substantial contributions should proceed through git
<a href="https://git-scm.com/book/en/v2/Distributed-Git-Distributed-Workflows">Integration-Manager Workflow</a>. See <a href="https://www.gnu.org/software/gnuastro/manual/html_node/Contributing-to-Gnuastro.html">this page</a> for an example of a
complete working session.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Francesco Montanari</p>
<p class="date">Created: 2017-04-22 Sat 17:58</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
